# IMPUTERS and ENCODING

Before Moving to the next model that is decision tree, we are going to to learn some concept here.

We are going to understand some advance techniques here.

Our model never ever understand any text 




We have to change text into some numbers





and also most common issue is null values . How we are going to treat null.



We know a simple methods like mean,mode,median . so these are very simple method.





So there are advance techniques that we are going to learn







1- Imputers





2- Encoding

Imputers - imputing null values , we are going to impute instead of saying fillna we are going to impute through different different techniques . There are also we have various technique. imputation technique.






Encoding - We are going to convert our categorical data . categories into some numbers, text into some numbers  that is encoding . within encoding we have several technique we will understand.

In [1]:
#Lets import

import warnings
warnings.filterwarnings('ignore')


import pandas as pd

In [2]:
df=pd.DataFrame({'Salary':[25000,48000,71000,85000,90000,55000],
                'City':['Bengluru','Delhi','Hyderabad','Bengluru','Hyderabad','Bengluru'],
                 'Gender':['Male','Female','Female','Female','Male','Male'],
                'Exp':[1,3,5,6,9,None]})
df

   Salary       City  Gender  Exp
0   25000   Bengluru    Male  1.0
1   48000      Delhi  Female  3.0
2   71000  Hyderabad  Female  5.0
3   85000   Bengluru  Female  6.0
4   90000  Hyderabad    Male  9.0
5   55000   Bengluru    Male  NaN

# Encoder and Imputer

In [3]:
from sklearn.preprocessing import LabelEncoder

In [4]:
lab_enc=LabelEncoder()

In [5]:
df2=lab_enc.fit_transform(df['City'])

In [6]:
pd.Series(df2)

0    0
1    1
2    2
3    0
4    2
5    0
dtype: int64

In [7]:
df['City']=df2

In [8]:
df

   Salary  City  Gender  Exp
0   25000     0    Male  1.0
1   48000     1  Female  3.0
2   71000     2  Female  5.0
3   85000     0  Female  6.0
4   90000     2    Male  9.0
5   55000     0    Male  NaN

In [9]:
from sklearn.preprocessing import  OneHotEncoder
from sklearn.impute import SimpleImputer
from sklearn.compose import make_column_transformer

In [10]:
ohe=OneHotEncoder()

In [11]:
si=SimpleImputer()

In [12]:
df=pd.DataFrame({'Salary':[25000,48000,71000,85000,90000,55000],
                'City':['Bengluru','Delhi','Hyderabad','Bengluru','Hyderabad','Bengluru'],
                 'Gender':['Male','Female','Female','Female','Male','Male'],
                'Exp':[1,3,5,6,9,None]})
df

   Salary       City  Gender  Exp
0   25000   Bengluru    Male  1.0
1   48000      Delhi  Female  3.0
2   71000  Hyderabad  Female  5.0
3   85000   Bengluru  Female  6.0
4   90000  Hyderabad    Male  9.0
5   55000   Bengluru    Male  NaN

In [13]:
ct=make_column_transformer(
    (ohe,['City','Gender']),
(si,['Exp']),
remainder='passthrough')#Passthrough to keep all the columns

In [14]:
encoded=pd.DataFrame(ct.fit_transform(df))
encoded

     0    1    2    3    4    5        6
0  1.0  0.0  0.0  0.0  1.0  1.0  25000.0
1  0.0  1.0  0.0  1.0  0.0  3.0  48000.0
2  0.0  0.0  1.0  1.0  0.0  5.0  71000.0
3  1.0  0.0  0.0  1.0  0.0  6.0  85000.0
4  0.0  0.0  1.0  0.0  1.0  9.0  90000.0
5  1.0  0.0  0.0  0.0  1.0  4.8  55000.0

In [15]:
#Rename the columns as per your choice 
encoded=pd.DataFrame(ct.fit_transform(df),columns=['City Banglore','City Hyderabad','City Delhi','Gender Male','Gender Female','Exp','Salary'])

In [16]:
encoded

,City Banglore,City Hyderabad,City Delhi,Gender Male,Gender Female,Exp,Salary
0,1.0,0.0,0.0,0.0,1.0,1.0,25000.0
1,0.0,1.0,0.0,1.0,0.0,3.0,48000.0
2,0.0,0.0,1.0,1.0,0.0,5.0,71000.0
3,1.0,0.0,0.0,1.0,0.0,6.0,85000.0
4,0.0,0.0,1.0,0.0,1.0,9.0,90000.0
5,1.0,0.0,0.0,0.0,1.0,4.8,55000.0

In [ ]:
# Continue in next lecture